In [1]:
import pandas as pd

# create a sample dataframe
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
}, index=[5, 4, 3, 2, 1])

df

   A
5  1
4  2
3  3
2  4
1  5

In [2]:
df.reset_index()

   index  A
0      5  1
1      4  2
2      3  3
3      2  4
4      1  5

In [3]:
df

   A
5  1
4  2
3  3
2  4
1  5

In [4]:
df.reset_index(inplace = False)

   index  A
0      5  1
1      4  2
2      3  3
3      2  4
4      1  5

In [5]:
df

   A
5  1
4  2
3  3
2  4
1  5

In [6]:
df

   A
5  1
4  2
3  3
2  4
1  5

In [7]:
df.reset_index(drop = True)

   A
0  1
1  2
2  3
3  4
4  5

In [8]:
df

   A
5  1
4  2
3  3
2  4
1  5

In [9]:
df

   A
5  1
4  2
3  3
2  4
1  5

In [10]:
df

   A
5  1
4  2
3  3
2  4
1  5

In [11]:
df = pd.DataFrame({"A": [1, 2, 3]}, index=["x", "y", "z"])

df

   A
x  1
y  2
z  3

In [12]:
df.reindex(["z", "x", "y", "a"])

     A
z  3.0
x  1.0
y  2.0
a  NaN

In [13]:
df

   A
x  1
y  2
z  3

In [14]:
df.reindex(["z", "x", "y", "a"])

     A
z  3.0
x  1.0
y  2.0
a  NaN

In [15]:
df

   A
x  1
y  2
z  3

In [16]:
df = pd.DataFrame({"A": [1, 2, 3, 4, 5]}, index=["x", "y", "z", "a", "b"])

df

   A
x  1
y  2
z  3
a  4
b  5

In [17]:
# drop certain index
df = df.drop(['a', 'b'])

In [18]:
df

   A
x  1
y  2
z  3

In [19]:
new_index = ["z", "x", "y", "c", "d"]

In [20]:
df.reindex(new_index)

     A
z  3.0
x  1.0
y  2.0
c  NaN
d  NaN

In [21]:
df

   A
x  1
y  2
z  3

In [22]:
# then reindex

df = df.reindex(new_index)

In [23]:
df

     A
z  3.0
x  1.0
y  2.0
c  NaN
d  NaN

In [24]:
import pandas as pd

# Let's create a simple DataFrame
df = pd.DataFrame({
    'A': ['foo', 'bar', 'baz', 'qux'],
    'B': ['one', 'one', 'two', 'three'],
    'C': ['small', 'large', 'large', 'small'],
    'D': [1, 2, 2, 3],
    'E': [2, 4, 5, 8]
})

df

     A      B      C  D  E
0  foo    one  small  1  2
1  bar    one  large  2  4
2  baz    two  large  2  5
3  qux  three  small  3  8

In [25]:
# Set 'A' column as the index of the DataFrame
df = df.set_index('A')
print("\nDataFrame after setting 'A' as index:")
df

DataFrame after setting 'A' as index:

         B      C  D  E
A
foo    one  small  1  2
bar    one  large  2  4
baz    two  large  2  5
qux  three  small  3  8

In [26]:
# Set 'A' column as the index of the DataFrame
df.set_index('B')
print("\nDataFrame after setting 'A' as index:")
df

DataFrame after setting 'A' as index:

         B      C  D  E
A
foo    one  small  1  2
bar    one  large  2  4
baz    two  large  2  5
qux  three  small  3  8

In [27]:
# Set 'A' column as the index of the DataFrame
df = df.set_index('B')
print("\nDataFrame after setting 'A' as index:")
df

DataFrame after setting 'A' as index:

           C  D  E
B
one    small  1  2
one    large  2  4
two    large  2  5
three  small  3  8

In [28]:
df

           C  D  E
B
one    small  1  2
one    large  2  4
two    large  2  5
three  small  3  8

In [29]:
df.reset_index(inplace = True)

In [30]:
df

       B      C  D  E
0    one  small  1  2
1    one  large  2  4
2    two  large  2  5
3  three  small  3  8

In [31]:
df.set_index('B')

           C  D  E
B
one    small  1  2
one    large  2  4
two    large  2  5
three  small  3  8

In [32]:
df

       B      C  D  E
0    one  small  1  2
1    one  large  2  4
2    two  large  2  5
3  three  small  3  8

In [33]:
df = df.set_index('B')

In [34]:
df

           C  D  E
B
one    small  1  2
one    large  2  4
two    large  2  5
three  small  3  8

In [35]:
df.set_index('C', append=True, inplace=True)
df

             D  E
B     C
one   small  1  2
      large  2  4
two   large  2  5
three small  3  8